Repository: Ertugrul-Kurubal/Data-Scientist
Catalog: Work/Modern Ways/Read Corpus/af-ar.tmx
Source language: af
Languages: ar

source: Omdat jy dit wil hê, beteken dit nog nie dat dit gaan gebeur.
ar: لأنك تريد ذلك هذا ليس معناه أن يحدث

source: Daar sê jy my wat.
ar: أخبرني عن ذلك

source: Vreemd tog, dit hou my nooit teen om dit te probeer.
ar: هذا مضحك . لا يوقفني أبدا من المحاولة

source: Marie.
ar: ماري .

source: - Is alles in orde?
ar: هل أنت بخير ؟

source: Ek is OK.
ar: أنا بخير.

source: - Ek het jou so gemis.
ar: أنا بخير. افتقدتك كثيراً

source: Het jy 'n afspraak met Delilah?
ar: أنت ودليلة ألديكم لقاء ساخن؟

source: Net 'n dinee.
ar: مجرد عشاء .

source: Jy is ook welkom, hoor.
ar: وأنت موضع ترحيب للانضمام .

source: - Dankie, maar, nee dankie, Tim.
ar: أوه ، شكرا، ولكن لا شكرا ، تيم .

source: Met drie is nie my styl.
ar: ليست طباعي

source: Tot môre, Tony.
ar: أراك غدا ، طوني .

source: Gaan na huis.
ar: مهلا. عد إلى بيتك

source: - Dit sal ek doen, baas.
ar: سأفعل يا رئيس.

source: Ek wil seker wees dat alles vlot verloop vir Anton.
ar: أريد فقط أن تأكد من أن أمور انطون تتم بسلاسة .

source: Dit is die minste wat ek kan doen.
ar: أقل ما يمكنني فعله ومن ثم إلى السرير

source: Daarna reg na bed. Erewoord.
ar: شرف الكشاف .

source: NCIS.S11E06.HDTV.x264-LOL
ar: ترجمة:

source: Alarm waarskuwing.
ar: حالة تأهب لقوة الحماية

source: Ek herhaal, naderende vyandig doel.
ar: تأكيد, هدف معادي يقترب

source: Begin die noodontruiming.
ar: ابدأوا إجراءات الإخلاء الطارئة تحرك ..

source: Vorentoe, vorentoe.
ar: تحرك هيا نذهب !

source: Kom op.
ar: هيا نذهب !

source: Die veiligheid is gebreek.
ar: خلل بحدود السلامة الخارجية

source: 60 sekondes voor die inslag.
ar: ستون ثانية على الاصطدام

source: Almal in die reddingsbote.
ar: جميع الأفراد إلى قارب النجاة .

source: Kom op, Machaca. Komaan.
ar: هيا، ماتشاكا .

source: - 30 sekondes voor die inslag.
ar: هيا. ثلاثون ثانية على الاصطدام

source: 59 siele opgeneem, sit die klok stil.
ar: تم عد 59 نفس أوقف الساعة

source: Drie minute, 40 sekondes.
ar: ثلاث دقائق و 40 ثانية . تلقيت ذلك

source: - Begryp. Die oefening is verby.
ar: اكتمل الحفر

source: Dat was pateties, Machaca.
ar: كان ذلك مثير للشفقة ماتشاكا .

source: Ek het vinniger na hier kan kruip.
ar: كان بإمكاني الزحف إلى هنا بشكل أسرع

source: Wees vrolik, dit is maar 'n oefening.
ar: استرح انه مجرد حفر

source: Is ons daar klaar mee?
ar: هل انتهينا ؟

source: Die eet word koud daar af.
ar: سلام, الجو أكثر برودة هنا

source: Ontploffing op die brug, ontploffing op die brug.
ar: انفجار على الجسر انفجار على الجسر

source: Dit is nie 'n oefening nie. Ek herhaal, dit is nie 'n oefening.
ar: هذه ليست مناورة أكرر، هذه ليست مناورة

source: - Episode 6 Oil Water
ar: النفطوالماء تاريخ العرض في 29 أكتوبر 2013 ترجمة:

source: McGee, ons het tog ooreengekom om hierdie jaar geen nachtelijk poets uit te haal.
ar: ماكجي ، اعتقدت أننا قلنا لا المزح الأذى من الليل هذا العام!

source: Mooi, so presisie, wie dit ook gedoen het, wat moet baie behendig wees.
ar: هذا النوع من الدقة - من فعل هذا حقاً فهو يملك بعض المهارات الخطيرة

source: Ek bedoel, oh nee, God.
ar: أعني، " أوه، لا .

source: Verskriklik, hoe durf hulle?
ar: أوه ، إلهي ، انه أمر مريع كيف يجرؤون "

source: Dus, jy het dit nie gedoen nie?
ar: لذا هذا يعني أن هذا ليس من فعلك؟

source: Het jy my lab nie onteer? - Wat? Nee.
ar: ألست أنت من دنس مختبري ؟

source: Wat het hulle gedoen?
ar: ماذا؟ لا.

source: Iemand het verskuif my werktafel sewe sentimeter na regs.
ar: ما فعلوا ؟ شخص ما حرك طاولة عملة ثلاث إنشات إلى اليمين

source: Jeetje, hoe durf hulle.
ar: أوه ، كيف يجرؤون على .

source: - Ek weet dit.
ar: أنا أعلم.

source: Wie dit gedoen het, het geweet dat ek dit sou sien selfs al was dit maar 'n haar verskuif.
ar: من فعلها يعرف أنني سألاحظ حتى لو تحركت شعرة من مكانها

source: Ons het te doen met 'n boosaardige geniale sadis.
ar: نحن نتعامل مع عبقرية شريرة .

source: Ek dink dat die helfte van jou gevolgtrekking klop.
ar: أعتقد أنك حصلت على نصف المعادلة, صحيح

source: Wat het ons hier?
ar: ماذا لدينا هنا ؟

source: Ek is bly dat jy ons gesprek oor veilig werk ernstig neem, maar, dat is daar wat oor, McRibbed.
ar: أنا سعيد لرؤيتك تأخذ حديثنا الصغير عن تأمين العملاء بمحمل الجد ولكن هذا زائد قليلا ، McRibbed .

source: - Jy het jou plesier gehad, Tony. Pak die maar uit.
ar: لقد حصلت على متعتك يا طوني انزعها هيا

source: - Oh, goh, ek is gevlei,.
ar: أوه ، يا إلهي ، أنا أشعر بالسعادة ،

source: Maar helaas, die voorkoming is my werk nie.
ar: ولكن للأسف ، طبقة الحماية هذه ليست من عملي, تفضلوا بقبول فائق الاحترام

source: Van wie dan?
ar: إذن هي من عمل من؟

source: - Wie weet? "The Great Pumpkin"?
ar: من يدري؟ القرع العظيم؟

source: Die ruiter sonder kop of miskien 'n Halloween gees uit die verlede?
ar: الفارس بلا رأس ؟ ربما أشباح الهالوين الماضي

source: Mike Franks?
ar: فرانكس مايك ؟

source: Die moontlikhede is eindeloos.
ar: الاحتمالات لا حصر لها.

source: Nie vir ons dooie marinier.
ar: ليس لميتنا من المارينز

source: Gryp jou dinge. Ons gaan na Virginia Beach.
ar: احزموا أغراضكم, سنذهب لشاطيء فرجينيا

source: Het jy 'n nuwe lessenaar, McGee?
ar: أحصلت على مكتب جديد ، يا ماكجي ؟

source: - Nie bepaal, baas.
ar: ليس بالضبط ، يا رئيس.

source: Dit lyk my tog nuut.
ar: تبدو جديدة بالنسبة إلي

source: Kom nou.
ar: هيا بنا

source: Ek was daar eers vanoggend, dus die poets moet afgelope nag uitgehaal is.
ar: كنت أول من أتى هذا الصباح لذا هذه المزحة تم تحضيرها في وقت ما ليلة البارحة

source: Toe ek gisteraand vertrek, was jy daar nog.
ar: وأنت كنت في المكتب عند مغادرتي

source: Ek het 'n dinee beplan.
ar: كان لدي خطط للعشاء.

source: - Om hoe laat?
ar: أي وقت؟

source: Weet ek nie meer nie.
ar: اه ، لا أذكر .

source: - Ek het vertrek om middernag, DiNozzo.
ar: أنا غادرت في منتصف الليل ، يا دينوزو

source: Jy was toe nog op kantoor.
ar: وأنت كنت ما زلت في المكتب.

source: Die omgewing is gesluit, meneer.
ar: المنطقة مغلقة يا سيدي

source: - Daar is 'n lyk in my jurisdiksie, onderofficier.
ar: لديكم جثة في نطاق اختصاصنا ، أيها الضابط .

source: - Ek volg die bevele van die baas, meneer.
ar: أنا فقط أتبع أوامر رئيسي, سيدي

source: Dus, as dat 'n probleem is, moet jy jou tot haar wend.
ar: حتى إذا كان هناك مشكلة ، يمكنك حلها معها

source: Wat doen jy, baas?
ar: ماذا تفعل يا رئيس ؟

source: Jy het hom gehoor, ons wag.
ar: لقد سمعت الرجل نحن ننتظر

source: - Wag?
ar: ننتظر؟

source: Waarop?
ar: ننتظر ماذا؟

source: - Op die een wat die leiding het, DiNozzo.
ar: الشخص المسؤول ، يا دينوزو

source: Jy kyk daarna.
ar: وأنت تنظر إليها

source: - Agent Borin, ek het dit kan weet.
ar: عميل بورين ، كان علي أن أعرف

source: Die teenwoordigheid van die kustwacht was tog 'n wenk.
ar: لذا ، فإن وجود خفر السواحل كان فكرة كبيرة جدا

source: Wat het jy, Borin.
ar: ماذا لديك بورين ؟

source: - Ontploffing op 'n aflandige olie platform en die lyk van 'n dooie marinier.
ar: انفجار واحد على متن منصة نفطية بحرية بالإضافة إلى جثة واحدة من مشاة البحرية

source: 'n Groot gemors vir NCIS en die kuswag.
ar: يساوي فوضى واحدة كبيرة ل NCIS و CGIS دائرة التحقيقات الجنائية البحرية ودائرة تحقيقات خفر السواحل الجنائية

source: Wat is die oorsaak?
ar: ما هو سبب الانفجار ؟

source: - Nog geen idee.
ar: - لا فكرة حتى الآن-

source: Ons mag nie aan boord vir die geblus is en die platform veilig beskou word.
ar: لم نتمكن من الصعود لمتن المنصة لمعالجة المشهد حتى يتم إحتواء الحرائق و تعتبر المنصة سليمة من الناحية الهيكلية

source: Die enigste ding wat ons het, is die lyk?
ar: لذلك كل ما لدينا هوي الجثة؟

source: - En die verklarings van die bemanning.
ar: وتصريحات-

source: Dit is daar 59, dus, begin maar.
ar: من الطاقم، كل ال 59 . لذا ، ربما قد ترغب في البدء.

source: Ja, gaan maar.
ar: نعم ، اذهب .

source: Fyn om te sien dat die span nie veel verander is, Gibbs.
ar: إنه من الجيد رؤية الفريق لم يتغير كثيرا، جيبس

source: Ek het treurig geword om te hoor oor David.
ar: أنا آسفة لما سمعته عن دافيد.

source: Dit was vir haar dalk geen maklike besluit.
ar: أنا متأكدة أن مغدارتها لم تكن قرارا سهلا بالنسبة لها

source: Ons het dit ook ervaar.
ar: و كنا جميعا هناك

source: - Het jy 'n lyk vir my, Borin?
ar: ألديك جثة تخصني، بورين ؟

source: Die slagoffer is Marv Hebner.
ar: الضحية هو مارف هيبنر .

source: Hy staan op die brug tydens die ontploffing.
ar: كان على الجسر في وقت الانفجار

source: Duikers het hom vanoggend uit die water gehaal.
ar: الغواصين سحبوا جثته من الماء هذا الصباح .

source: Sy bolyf het die grootste slag gekry.
ar: جذعه العلوي ووجهه أخذوا الجزء الأكبر من الضرر

source: Die skade deur skerwe is oppervlakkig, dat is die oorsaak van dood nie.
ar: ضرر الشظايا ضرر سطحي ولن تكون سببا للوفاة

source: Dit weet ons na die ondersoek van Ducky.
ar: لا نعلم بعد حتي يقوم داكي بدراسته

source: - Vertrou my maar.
ar: ثق بي

source: Ek het al genoeg trauma deur ontploffings.
ar: رأيت نصيبي صدمة تأثير الإنفجار عن قرب

source: Maar, Dr Mallard sal beslis my vermoede kan bevestig.
ar: ولكن أنا متأكدة من أن الدكتور مالارد سيكون قادر على تأكيد شكوكنا .

source: Het jy gekommunikeer met Hebner, tydens die oefening?
ar: أكان لك إتصال ب"هينبر" أثناء الحفر

source: Juis, tot aan die ontploffing.
ar: نعم. حتى الانفجار

source: Hy het gesê dat alle stelsels normaal was.
ar: آخر تقرير كانت جميع الأنظمة طبيعية به

source: Ek werk al jare op olieplatformen, maar dit het ek nog nooit gesien nie.
ar: كما تعلم، لقد قضيت سنوات أعمل على منصات النفط لم أر أي شيء مثل هذا يحدث من قبل

source: Ek bedoel, ons kry waarskuwing en alarm seine, fout boodskappe.
ar: أعني ، لدينا علامات التحذير ، أجهزة الإنذار، و أمان الفشل.

source: As Hebner die enigste was wat die beheer bemande is dit dan nie moontlik dat hy die waarskuwingstekens oor die hoof gesien het?
ar: حسنا, إذا هيبنر وحده من يدير التحكمات هل من الممكن انه تجاهل واحدة من علامات التحذير ؟

source: 'n Menslike fout?
ar: خطأ بشري ؟

source: - Nee. Marv was die mees ervare man van die platform.
ar: مارف هو أكثر رجل ذو خبرة على منصة

source: Hy was nie die tipe wat foute maak.
ar: هذا الرجل ليس من النوع الذي يرتكب الأخطاء .

source: - Ek moet hom sien.
ar: أنا بيج هيبنر. أحتاج لأن أرى .

source: Ek soek...
ar: أبحث عن ...

source: - Nee, ek moet hom sien.
ar: لا، علي رؤيته . جونا !

source: Jonah. Dit is die vrou van Marv.
ar: انها زوجة مارف .

source: - Jonah.
ar: جونا .

source: He, Paige.
ar: مهلا، بيج .

source: - Hy is dit nie, tog?
ar: انه ليس هو ، أليس كذلك؟

source: Tog wel.
ar: إنه هو.

source: Dit is so jammer, Page.
ar: أنا آسف جدا ، بيج .

source: Mevrou, Hebner, my simpatie.
ar: سيدة هيبنر آسف لخسارتك .

source: Ek verstaan dit nie.
ar: أنا لا أفهم.

source: Ek het Marv gister nog aan die telefoon en alles is reg.
ar: لقد تحدثت للتو إلى مارف ليلة أمس على الهاتف ، وكان كل شيء على ما يرام.

source: Wat is gebeur.
ar: ماذا حدث؟

source: - Dat probeer ons om uit te pluis.
ar: نحن نحاول أن نكتشف ذلك .

source: Waar is hy?
ar: أين هو؟

source: Niemand aan boord herinner iets ongewoons vir die ontploffing.
ar: لاأحدعلىمتنها يتذكرأيشيء استثنائي قبل وقوع الانفجار .

source: Alle stelsels het gewerk normaal.
ar: فحص النظام كان طبيعيا

source: 'n Gereelde weeksdag.
ar: المتوسط اليومي

source: - Die instruksies sentrum is gebel deur die kaptein van 'n vragskip.
ar: ولكن لم ينته بهذه الطريقة حصل مركز القيادة مكالمة من الكابتن من سفينة شحن بضائع

source: Hy herinner ' n onverligte motorboot, wat verby voer, gisteraand by die platform.
ar: وأشار إلى مرور زورق آلي مع أضواء غير وظيفية تعمل بالقرب من المنصة الليلة الماضية .

source: - Dink jy aan 'n terroriste aanslag?
ar: أتعتقد أنه من الممكن أن يكون نوعاً ما الهجمات الإرهابية؟

source: Dit was beslis geen drank cruise.
ar: بالتأكيد لم تكن رحلة بحرية صاخبة

source: - Verskoon, agent Borin.
ar: عذراً ، عميل بورين ؟

source: Binnelandse veiligheid het alle olie installasies verskrik.
ar: الأمن الداخلي وضع جميع منشآت الولايات المتحدة النفطية في حالة تأهب قصوى .

source: Dit is óf 'n geïsoleerde voorval of...
ar: لذا هذا هو إما حادثا فرديا أو ...

source: - Die begin van meer dat nog moet kom.
ar: انه بداية للمزيد في المستقبل

source: Timmy, jy het ten prooi geval aan een van die oudste grappe in die boekie.
ar: تيمي أنت سقطت فريسة ل أحد أقدم المزحات في الكتب.

source: Daarom dat klassiekers nooit gaan verveeld.
ar: انا اعتقد لهذا السبب فالكلاسيكيات لا تخرج إبدا عن النمط.

source: Gebrek aan fantasie en individualiteit?
ar: فقر في التخيل والتفرد ؟

source: Lyk op jou manier van doen.
ar: يبدو وكأنها من فعلك

source: Moenie kwaad op my wees nie.
ar: لا تكن غاضبا في وجهي .

source: Weet jy wat?
ar: أتعلم ما هو؟

source: Jy maak jouself tot 'n te maklik doel, McBull's-eye.
ar: ان تجعل نفسك هدفاً سهل جدا ، عين الثور

source: Jy moet bly beweeg.
ar: أنت بحاجة للاستمرار

source: Ek nie, ek is meer 'n uitdaging.
ar: الآن ، أنا ، أنا أحب التحدي.

source: Daar 'n uithaal met Gibbs, dat sou die prestasie van die eeu wees.
ar: عمل واحدة في جيبس ، التي من شأنها أن تكون فذة لكل الأجيال .

source: Wat het jy, 'n dood wil?
ar: ماذا لديك ؟ رغبة في الموت ؟

source: - Ek wil op gevaarlike wyse lewe.
ar: (على غرار شون كونري ) : أنا أحب أن أعيش بشكل خطير.

source: Ons dooie marinier, kom op.
ar: جندي البحرية المتوفي هيا بنا

source: Marv Hebner, 45, majoor in die gekies reserve marinierskorps.
ar: مارف هيبنر ، 45 ، رائد في سلاح إحتياط البحرية الأمريكية

source: Saam met die geniebataljon het hy meegedoen aan drie missies in Irak en Afghanistan.
ar: مع كتيبة قتال منهدسين أكمل ثلاث جولات في العراق و أفغانستان .

source: Sy nuutste missie het geëindig agt maand gelede, toe het hy terug gaan werk vir CityLine Oil.
ar: وأحدث إنتشار له انتهى قبل ثمانية أشهر ، عندما عاد للعمل من أجل سيتي لاين للنفط .

source: 'n Mediumgrootte oliebedrijf met 'n onberispelik veiligheid.
ar: انها شركة نفط من المستوى المتوسط وسجل السلامة لا تشوبه شائبة

source: Tot nou toe, natuurlik.
ar: حتى الآن ، بطبيعة الحال.

source: - Updates van binnelandse veiligheid?
ar: التحديثات من هوملاند ؟

source: Hulle hou die bedreiging verhoog, maar daar is geen gerugte en geen enkele terreurgroep eis die ontploffing op.
ar: حسنا، انهم أبقوا مستوى التهديد مرفوعاً ، ولكن ليس هناك فرقة ، أو جماعة إرهابية أعلنت مسؤوليتها عن الانفجار .

source: Die olie industrie is 'n kolfje na die hand van Benham Parsa.
ar: عالم النفط لديه اسم بنهام بارسا مكتوب في كل ذلك .

source: FBI?
ar: الإف بي أي؟

source: - Hulle dink nie dat daar 'n verband is.
ar: لا أعتقد أن هناك اتصال.

source: Volgens intelligensie sit Parsa nog wegkruip.
ar: إنتل تظهر أن بارسا لا يزال تحت الأرض .

source: Marine en kuswag speur vanuit die lug na die skelm boot, wat deur die vragskip gerapporteer is.
ar: البحرية وخفر السواحل لديهم دعم جوي يبحث عن القارب الغريب الذي أبلغت سفينة الشحن عنه

source: - Ja, Gibbs.
ar: نعم، جيبس .

source: Dankie dat u vergader met ons afwesigheid van direkteur Vance.
ar: عميل جيبس شكرا لانضمامك لنا في غياب المدير فانس .

source: Laat me u voorstelle aan Perry Davidson, bestuurder van CityLine Oil en hul adviseur, Brett Creevy.
ar: اسمحوا لي أن أعرض لكم ل بيري ديفيدسون ، الرئيس التنفيذي لشركة سيتي لاين للنفط

source: - U moet weet dat CityLine alles in die werk stel om dit tot op die bodem uit te soek.
ar: نريد منك أن تعرف أن سيتي لاين تقوم باستخدام جميع الوسائل لدينا للوصول الى الجزء السفلي من هذه الفوضى .

source: As ons soos hoe dan ook kan help, laat dit ons asseblief weet.
ar: اذا كنا نستطيع المساعدة بأي الأشكال، أخبرونا .

source: Die laaste ding wat ons wil is 'n oliestorting soos in die Golf.
ar: وآخر شيء نريده هو كارثة أخرى للنفط بالخليج

source: Daar is ek dit volledig mee eens.
ar: على أيدينا . البيت الأبيض لا يمكن أن توافق أكثر من ذلك.

source: Daarom het ek die opdrag toe te sien op hierdie navorsing.
ar: ذلك هو السبب في أنهم قد كلفوني بالإشراف على هذا التحقيق .

source: Marv Hebner was lid van die CityLine familie.
ar: مارف هيبنر كان عضوا

source: Dit is 'n swaar verlies.
ar: انها خسارة عميقة

source: Mr Creevy en ek was gisteroggend nog op dat platform.
ar: السيد كريفي وأنا تجولنا على منصة في وقت سابق من صباح أمس .

source: Ek kon my nie voorstel dat dit sou gebeur.
ar: أنا ابدأ لم أتصور إمكانية حدوث هذا

source: Ons weet dat ons platforms 'n moontlik doel is vir terreuraanvallen.
ar: و نحن على علم أن منصاتنا قد تكون هدفا محتملا لهجوم ارهابي

source: Ons berei daar ons op voor, maar, dit kom tog hard aan.
ar: ونحن نستعد لذلك ، لكنه ما زال صدمة

source: Ek dink dit is 'n bietjie voortydig om van 'n terreuraanval te praat, menere.
ar: أعتقد أنه من السابق لأوانه قليلا أن نفترض أن هذا من أعمال الإرهاب ، يا سادة

source: Ek is seker dat NCIS al ondersoekende paaie oop hou.
ar: NCISأنا متأكدة من أن ستبقي جميع مسارات التحقيقات مفتوحة

source: Wel, as dit 'n aanslag was, dan was hy nie baie strategies.
ar: حسنا ، إذا كان هجوما فهو استراتيجي للغاية واحدة .

source: Hoe bedoel u dat?
ar: وماذا يعني هذا؟

source: Op gebied van die uitvoer en mannekrag.
ar: انها مسألة الناتج والطاقة البشرية

source: Dit platform produseer slegs 'n fraksie van ander installasies aan die ooskus en dit word beman deur 'n ploeg 60.
ar: هذه المنصة تنتج جزءاً من النفط مقارنة بما لدينا من وحدات أخرى على الساحل الشرقي ، و المأهولة من قبل طاقم قوامه ستون .

source: Op die ander sit daar meer as 200.
ar: المنصات الأخرى تتعدى ال 200

source: Die gevolge van 'n groter platform sou rampspoedig wees.
ar: أتداعيات في منصات أكبر كانت لتكون مدمرة

source: Die prioriteit is om die oorsaak aan te pak en die skade te verminder.
ar: أولويتنا هي معالجة سبب هذا الحادث ومعرفة أفضل وسيلة للحد من الأضرار .

source: Daar is 'n man dood, dat val moeilik te verminder.
ar: موت رجل من الصعب التقليل من ذلك.

source: Eeue was die aand van die heiliges 'n tyd van viering en bygeloof.
ar: لقرون، عشية كل الأقداس ' كان وقتا للاحتفال والخرافات .

source: Dit sou ontstaan is uit die Keltiese fees Samhain, toe volgelinge vreugdevure gedoen brande in 'n poging om rondreisende spoke en bose geeste af te weer.
ar: ويعتقد أن تكون قد نشأت مع مهرجان سلتيك سامهاين ، حيث يقوم المتبعون بإشعال الموقد

source: Ah.
ar: و ترصد الأرواح الشريرة .

source: Het jy iets gehoor?
ar: ألم تسمع شيئا؟

source: Hoe dan ook, Halloween is gegroei tot 'n vakansie vir die kinders.
ar: على أي حال ، هالوين لديه منذ تطور ، كل شيء ، عطلة للأطفال.

source: Gretige gesigte, sommige geklee in 'n twyfelagtige vermomming, wat van deur tot deur gaan, vir 'n lekkergoed of verrassing.
ar: وجوه تواقة ، بعض يرتدون ملابستمويه من الباب إلى الباب بحثا عن خدعة أو علاج.

source: Wat het jy vir my, Dr Mallard?
ar: وماذا لديك بالنسبة لي ، د. مالارد ؟

source: - Agent Borin. Ek het gehoor dat ons paaie sou kruis.
ar: عميل بورين ، كنت قد سمعت أن مساراتنا تتلاقى مرة أخرى

source: - Die gerug gaan vinnig.
ar: حسنا ، الكلمة تسافر بسرعة .

source: ek kan my nie voorstel dat ek die enigste is wat bly is dat jy in ons klein kudde sit.
ar: حسنا ، لا أستطيع أن أتخيل أنني أنا فقط من هو سعيد أن تسنى لك العودة الى قطيعنا الصغير ،

source: Al is dit net tydelik.
ar: وإن كان مؤقتا .

source: Euh, Dr Mallard.
ar: اه، د. مالارد ؟

source: - Het jy gehoor dat?
ar: هل سمعت ذلك ؟

source: Wat hoor?
ar: سمعت ماذا ؟

source: - Een sagte beep.
ar: زمارة خافتة .

source: Oh, dit spyt my, my beste.
ar: أوه ، أنا آسف ، يا عزيزتي .

source: Waar was ek?
ar: أين كنت؟

source: - Sê my, Duck.
ar: أنت أخبرني داك

source: Ah, Jethro.
ar: آه ، جيثرو .

source: Ek het bevestig wat julle al afgelei het.
ar: كنت على وشك تأكيد ما قمتم أنتم الاثنين باستخلاصه بالفعل

source: Die liggaam van majoor Hebner het 'n fors trauma deur die ontploffing.
ar: الهيئة الرئيسية لجثة هيبنر هو حصل في الواقع كمية كبيرة من الصدمات من الانفجار ،

source: Maar geen van sy belangrike inwendige organe is geraak.
ar: ولكن الأعضاء الداخلية له الحيوية, لم تتأثر

source: Wat was dan die oorsaak van dood?
ar: ما هو سبب الوفاة إذا ؟

source: - Wel, hierdie man verdrink.
ar: حسنا ، الرجل غرق .

source: Ek vermoed dat hierdie kneusing hom bewusteloos gemaak het voor hy in die water geval het.
ar: وأظن أن هذه كدمة جعلته فاقدا للوعي قبل دخوله المياه .

source: He, Borin.
ar: مهلا، بورين .

source: Verskoning.
ar: إسمحوا لي .

source: Borin. - Het jy nog iets, Duck?
ar: بورين .

source: Wel, ek het nogal wat materiaal gehaal van die vel van die majoor.
ar: أحصلت على أي شيء آخر ، داك ؟ حسنا ، أنا سحبت كمية كبيرة من المواد من جلد الرائد .

source: Hierdie goue fragmente is die mees eienaardige.
ar: هذه الشظايا الذهبية هي الأكثر غرابة .

source: Ek het hulle na Abby gestuur, vir die analise.
ar: كنت على وشك أن أرسل منها الى آبي للتحليل.

source: Daar het jy dit weer, waar kom die afleidende piep tog vandaan.
ar: أوه ، ها هو مرة أخرى! من أين تأتي هذه الصافرة الغريبة؟

source: 'n patrollie het die skelm motorboot gevind vyf myl ten suide van die olie platform.
ar: وجدت دورية لدينا الزورق غارقاً في المياه على بعد خمسة أميال من المنصة

source: Afkomstig van 'n seiljag, wat die gesink het berig, vorige week.
ar: تتبعناه إلى طراد اليخت الذي أبلغ أنه غرق في بحر هائج الاسبوع الماضي .

source: Ons moet aan boord van die platform gaan.
ar: علينا الوصول لسطح المنصة

source: - Wel, jy het geluk, die vuur is geblus.
ar: نعم، حسنا ، أنت محظوظ - الحرائق انتهت

source: Ons kan die plaas van die misdaad ondersoek.
ar: وبإمكاننا متابعة مسرح الجريمة

source: Weet jy, majoor, ek glo dat daar onheil op koms is.
ar: أتعلم أيها الرائد أعتقد أن هناك خسارة على قدم وساق .

source: Wat dink jy?
ar: ما رأيك؟

source: Abby?
ar: آبي ؟

source: Brand.
ar: النار!

source: Daar is brand.
ar: هناك نيران!

source: McGee?
ar: ماكجي ؟

source: - Dit is in orde, geen paniek.
ar: -كل شيء على ما يرام لا داعي للذعر .

source: Sien ek daar in paniek uit?
ar: هل أبدو مذعورة ؟

source: - Eintlik nie.
ar: في الواقع ، لا.

source: Dit is salie, McGee.
ar: انها حكيمة ،يا ماكجي .

source: Ek suiwer my heiligdom van die negatiewe karma agter gelaat deur die Halloween grapjas.
ar: أنا أقوم بتنقية ملاذي من الكارما السلبية من مخادع هالوين ألا تظني أنك تتحمسين زيادة عن اللزوم؟

source: - Oordoen jy nie wat? Ek wil ook nie dat Tony m'n dinge prutst, maar ek gebruik net bleikmiddel.
ar: أعني، أنا لا أحب ذلك عندما يلمس طوني أشيائي ، لكن ،

source: Wel, ons is nie seker van dat hy dit is.
ar: ولكن أنا فقط استخدام مواد التبييض . حسنا ، نحن لسنا على يقين من أن انه هو

source: Ons moet dus, alle voorsorgmaatreëls neem.
ar: لذلك علينا أن نأخذ جميع الاحتياطات

source: Abby, jy het gesê dat jy iets gevind het.
ar: آبي ، قلت لك أوجدت شيئا ؟

source: - Dit het ek.
ar: فعلت.

source: Dit is die mainframe van die olie platform.
ar: هذه هي وحدة التشغيل المركزية على متن المنصة النفطية .

source: Ek het al hulle stelsel funksies nagegaan tot aan die ontploffing,
ar: لقد راجعت كل نظامهم حتى حصول الانفجار ،

source: Soos die bemanning al gesê het, alles was normaal.
ar: و تماما مثلما قال الطاقم، كان كل شيء طبيعيا .

source: Ek het niks gevind.
ar: لم أجد شيئا.

source: Ek het gedink jy het gesê dat jy iets gevind het.
ar: ظننت أنك قلت أنك وجدت شيئا

source: Wel, dan is die "niks " die " iets".
ar: حسنا، لا شيء ... هو شيء .

source: Abby, is jy seker dan jy nie van die salie ingesluk het?
ar: آبي ، هل أنت متأكد من أنك لم تلتهمي أي من ذلك الملاذ ؟

source: Miskien.
ar: ربما .

source: Ek het gevind verborge malware op hul server.
ar: لقد وجدت البرمجيات الخبيثة المخفية المثبتة على الخادم الخاص بهم .

source: Dit is 'n rootkit.
ar: انها الجذور الخفية ،

source: Dit gee die hacker oral toegang, sonder bespeur te word.
ar: لذا هذ يعطي القراصنة امكانية الوصول إلى كل شيء على متنها دون أن يتم اكتشافهم .

source: Dit beteken dat iemand die stelsel kon manipuleer, die ontploffing van op afstand veroorsaak sonder die alarm te doen afgaan.
ar: وهو ما يعني أن شخص ما ربما تمكن من التلاعب بالأنظمة، مما تسبب في انفجار عن بعد دون إحداث أي إنذار .

source: Hoe is dit in die platform gebring?
ar: كيف تم تحميلها على المنصة ؟

source: - E-mail spam.
ar: الرسائل البريد الإلكتروني الغير المرغوب فيها

source: Wie sou 'n lêer oopmaak, " vergroot en lei"?
ar: من بإمكانه فتح ملف مسئول

source: Ek het dalk nog 'n manier om die programmeerder op te spoor.
ar: قد يكون لدينا وسيلة أخرى لتتبع هذا مبرمج .

source: Hackers dink van hulself dat hulle kunstenaars is.
ar: قراصنة نميل إلى الاعتقاد في أنفسهم كفنانين

source: Sommige vind selfs 'n manier om hul werk te signeren.
ar: حتى أن بعض يجد وسيلة لتوقيع عملهم
